<template>
  <div class="task">
    <h2>Описание задачи</h2>
    <p>
      «Подбор стола для сидения за ним (при заданной глубине)»
    </p>
    <h3>Входные значения</h3>
    <h4>1) Высота (диапазон 0 – 200, см)</h4>
    <p>
      a. Столешница лежит на полу (0 – 7 – 15)<br />
      b. Ниже стула (12 – 20 – 35)<br />
      c. Как стул (20 – с 30 до 50 – 80)<br />
      d. Как стол (70 – с 80 до 90 – 130)<br />
      e. С рост человека и выше (120 – с 160 до 180 – 200)
    </p>
    <h4>2) Ширина (диапазон 0 – 200, см), глубину не берем</h4>
    <p>
      a. Возможно можно положить телефон боком (0 – 8 – 15)<br />
      b. Можно положить раскрытую тетрадь (25 – 38 – 55)<br />
      c. Можно положить раскрытую тетрадь, локти и что-нибудь мелкое (40 – с 60
      до 75 – 90)<br />
      d. Можно растянуть руки в разные стороны (120 – с 130 до 160 – 200)
    </p>
    <h4>3) Материал (диапазон 0 – 100, степень прочности)</h4>
    <p>
      a. Палки и листья (0 – 3 – 8)<br />
      b. Картон (5 – 10 – 20)<br />
      c. Фанера (18 – 45 – 60)<br />
      d. Дерево/дсп (50 – с 50 до 75 – 85)<br />
      e. Камень (80 – с 95 до 100)<br />
    </p>
    <h4>4) Место для протягивания ног (диапазон 0 – 150, см)</h4>
    <p>
      a. Хватит для детской ступни (0 – с 12 до 15 – 20)<br />
      b. Хватит для большой ступни (20 – 28 – 35)<br />
      c. Норм, если согнуть ноги в коленях (25 – 40 – 50)<br />
      d. Можно расправить ноги среднего роста человеку (65 – 85 – 100)<br />
      e. Можно расправить ноги высокого роста человеку и еще останется место (90
      – 110 – 150)
    </p>
    <h3>Выходное значение</h3>
    <p>
      1) Стоит ли сидеть за столом (0 – 100, степень удобства)<br />
      a. Это не похоже на стол (0 – 5 – 10)<br />
      b. Лучше не садиться, но если очень хочется… (7 – 14 – 23)<br />
      c. Это стол за 100 рублей, что-то легкое маленькое положить норм (18 – 28
      – 35)<br />
      d. Можно сесть и попробовать писать за столом (30 – с 40 до 50 – 60)<br />
      e. Удобно печатать и стол выдержит агрессивное печатание (53 – с 65 до 80
      – 85)<br />
      f. Можно танцевать (85 – с 92 до 100)
    </p>
  </div>
</template>

<style lang="scss" scoped>
.task {
  text-align: left;
  line-height: 200%;
}

h3 {
  color: $accent;
}
</style>
