import Vue from "vue";
import App from "./App.vue";
import router from "./router";
import store from "./store";

// import fuzzy from "./fuzzy-min";
// Vue.use(fuzzy);

// var obj = {
//   crisp_input: [60, 0, 0, 0],
//   variables_input: [
//     {
//       name: "Высота",
//       setsName: [
//         "Столешница очень низко",
//         "Ниже стула",
//         "Как стул",
//         "Как стол",
//         "С рост человека и выше"
//       ],
//       sets: [
//         [0, 0, 7, 15],
//         [12, 20, 20, 35],
//         [20, 45, 45, 80],
//         [70, 85, 85, 130],
//         [120, 160, 200, 200]
//       ]
//     },
//     {
//       name: "Ширина",
//       setsName: [
//         "Поместится телефон боком",
//         "Поместится раскрытая тетрадь",
//         "Поместится 2 раскрытые тетради",
//         "Можно растянуть руки в разные стороны"
//       ],
//       sets: [
//         [0, 0, 8, 28],
//         [25, 38, 38, 55],
//         [40, 68, 68, 120],
//         [100, 145, 200, 200]
//       ]
//     },
//     {
//       name: "Материал",
//       setsName: ["Палки и листья", "Картон", "Фанера", "Дерево/дсп", "Камень"],
//       sets: [
//         [0, 0, 3, 8],
//         [5, 10, 10, 25],
//         [18, 45, 45, 60],
//         [50, 63, 63, 85],
//         [80, 95, 100, 100]
//       ]
//     },
//     {
//       name: "Место для протягивания ног",
//       setsName: [
//         "Для детской ступни",
//         "Для большой ступни",
//         "Норм, если согнуть ноги в коленях",
//         "Можно расправить ноги среднего роста человеку",
//         "Можно расправить ноги высокого роста человеку"
//       ],
//       sets: [
//         [0, 0, 14, 23],
//         [20, 28, 28, 35],
//         [30, 45, 45, 65],
//         [60, 85, 85, 100],
//         [90, 110, 150, 150]
//       ]
//     }
//   ],
//   variable_output: {
//     name: "Стоит ли сидеть за столом",
//     setsName: [
//       "Это не похоже на стол",
//       "Лучше не садиться, но если очень хочется...",
//       "Для аккуратного ребенка",
//       "Для подростка",
//       "Для взрослого",
//       "Для компании друзей"
//     ],
//     sets: [
//       [0, 0, 5, 10],
//       [7, 14, 14, 23],
//       [18, 28, 28, 35],
//       [30, 45, 45, 60],
//       [53, 73, 73, 85],
//       [78, 92, 100, 100]
//     ]
//   },
//   /**
//    * Количество массивов - сколько входных переменных
//    * В каждом массиве столько элементов, сколько во
//    * входной переменной
//    */
//   inferences: [
//     [0, 1, 2, 4, 5],
//     [0, 1, 2, 3],
//     [0, 1, 2, 4, 5],
//     [0, 2, 3, 4, 5]
//   ]
// };
// var fl = new fuzzy();

// let aaa = fl.getResult(obj);
// console.log(aaa);

Vue.config.productionTip = false;

new Vue({
  router,
  store,
  render: h => h(App)
}).$mount("#app");
